In [1]:
import mysql.connector
import pandas as pd
from dotenv import load_dotenv
import os
from sql_helpers import run_sql_query, create_lesson_8_db
load_dotenv()  # loads variables from .env file
mysql_password = os.getenv("MYSQL_PASSWORD")
connection = mysql.connector.connect(
    host="localhost",
    user="root",
    password=mysql_password,
)
cursor = connection.cursor()

In [2]:
create_lesson_8_db(cursor, connection)

In [3]:
run_sql_query("SELECT * FROM Customer", cursor)

   id first_name last_name contact_number
0   1       Ivor   Woodard  0800 407 6465
1   2     Hakeem     Cross      0800 1111
2   3    Leonard      Love    0800 947865
3   4        Sal      Cobb   07064 474116
4   5     Rhonda    Slater     0845 46 48
5   6       Zeph  Mcknight  (016977) 5458
6   7     Yoshio    French    0800 580161
7   8     Darryl   Dillard  086 4778 6368
8   9     Porter  Mcknight    01697 72332
9  10       Maia     Logan    08 45 46 47

In [4]:
run_sql_query("SELECT * FROM Address", cursor)

,id,house_name_number,postcode,customer_id,is_default,instructions
0,1,53,X16 6UM,1,1,Use side entrance
1,2,"65, Lodge House",BC01 7KJ,2,0,
2,3,94,G2D 2QA,3,0,None
3,4,28,M2 1LE,4,1,
4,5,5,OS7 6KB,5,0,None
5,6,122,I37 1QZ,6,0,
6,7,17B,B8V 1LS,7,1,None
7,8,The Tower,XX44 2UW,1,0,Ring doorbell twice
8,9,18,H2M 9HM,9,1,None
9,10,88,C10 4LH,10,1,None

In [5]:
run_sql_query("SELECT * FROM Product", cursor)

,id,title,description,price,category
0,1,Mozzarela sticks (4),"Sticks of mozzarela cheese, coated in bread cr...",4.99,Starters
1,2,Garlic bread,Pizza dough with a garlic topping,3.50,Starters
2,3,BBQ ribs,A full rack of ribs covered in BBQ sauce,5.99,Starters
3,4,Garden salad,"A mixed garden salad, including tomatoes, mixe...",1.50,Starters
4,5,Margherita pizza,"The Italian classic, a thin crust and tomato-b...",9.99,Mains
5,6,Fried chicken (6 pieces),Using 8 secret spices mixed in a breadcrumb co...,10.45,Mains
6,7,Coconut curry noodle bowl,A vegan noodle dish with cashews and pak choi,7.85,Mains
7,8,Onion rings,Covered in beer-infused batter and fried,2.00,Sides
8,9,Fries,"Maris piper potatoes, thinly cut, and fried in...",3.00,Sides
9,10,Vegan chocolate milkshake,Made with vegan chocolate ice 'cream' and oat ...,4.80,Drinks

In [6]:
run_sql_query("SELECT * FROM OrderContent", cursor)

    order_id  product_id  amount
0          1           4       2
1          1           6       1
2          1          10       3
3          2           2       1
4          2           7       4
5          3           2       3
6          3           6       1
7          4           3       1
8          4           5       1
9          5          10       2
10         6           5       2
11         7           1       2
12         7           2       2
13         7           3       1
14         7           4       2
15         8           4       1
16         8           8       1
17         9           7       2
18        10           1       2
19        10           5       2
20        10           8       1
21        11           4       1
22        12           2       2
23        12           3       2
24        13           5       3
25        14           5       2
26        15           1       1
27        15           6       3
28        15           7       2
29        16           1       2
30        16           3       2
31        16           5       1
32        16           8       3
33        17           5       3
34        18           6       2
35        18           7       1
36        19           2       3
37        19           6       3
38        19           8       3
39        20           7       2

In [53]:
# TASK 1
# Context - During a recent customer support review, it was discovered that some customer records had incorrect contact numbers, mistakenly starting with “0800” or “0845”, which are often reserved for national helplines or business contact numbers. To avoid miscommunication, you have been tasked with finding all customer records with contact numbers that start with these prefixes.
# Task - Write a query to list the customer’s ID, first name, last name, and contact number for all customers whose contact numbers start with 0800 or 0845.
query = """
SELECT
    id AS customer_id,
    first_name,
    last_name,
    contact_number
FROM Customer
WHERE contact_number LIKE '0800%'
   OR contact_number LIKE '0845%';
        """
run_sql_query(query, cursor)

   customer_id first_name last_name contact_number
0            1       Ivor   Woodard  0800 407 6465
1            2     Hakeem     Cross      0800 1111
2            3    Leonard      Love    0800 947865
3            5     Rhonda    Slater     0845 46 48
4            7     Yoshio    French    0800 580161

In [10]:
# TASK 1 - ADDING VALIDATION for disjointed numbers
# Context - During a recent customer support review, it was discovered that some customer records had incorrect contact numbers, mistakenly starting with “0800” or “0845”, which are often reserved for national helplines or business contact numbers. To avoid miscommunication, you have been tasked with finding all customer records with contact numbers that start with these prefixes.
# Task - Write a query to list the customer’s ID, first name, last name, and contact number for all customers whose contact numbers start with 0800 or 0845.
query = """
SELECT
    id AS customer_id,
    first_name,
    last_name,
    contact_number
FROM Customer
WHERE REPLACE(contact_number, ' ', '') LIKE '0800%'
   OR REPLACE(contact_number, ' ', '') LIKE '0845%';
        """
run_sql_query(query, cursor)

   customer's ID first name last name contact number
0              1       Ivor   Woodard  0800 407 6465
1              2     Hakeem     Cross      0800 1111
2              3    Leonard      Love    0800 947865
3              5     Rhonda    Slater     0845 46 48
4              7     Yoshio    French    0800 580161
5             10       Maia     Logan    08 45 46 47

In [54]:
# TASK 2
# Context - The logistics team wants to review order delivery details for tracking and delivery route optimization. They have asked for a list of all orders showing the order date, customer’s name, and the delivery address where the order was sent.
# Task - Write a query to display the order date, customer name (first and last name combined as customer_name), and the house name/number and postcode of the delivery address for each order. Sort the results by order date in ascending order.
query = """
SELECT
    o.order_date,
    CONCAT(c.first_name, ' ', c.last_name) AS customer_name,
    a.house_name_number,
    a.postcode
FROM OnlineOrder o
JOIN Customer c
    ON o.customer_id = c.id
JOIN Address a
    ON o.delivery_address_id = a.id
ORDER BY o.order_date ASC;
        """
run_sql_query(query, cursor)

            order_date    customer_name house_name_number  postcode
0  2021-01-23 01:41:50       Maia Logan                53   X16 6UM
1  2021-02-05 18:34:05     Leonard Love                 5   OS7 6KB
2  2021-02-28 19:15:30    Rhonda Slater                18   H2M 9HM
3  2021-04-16 00:40:09         Sal Cobb               17B   B8V 1LS
4  2021-04-21 20:29:11   Darryl Dillard                53   X16 6UM
5  2021-05-28 01:36:32    Zeph Mcknight               122   I37 1QZ
6  2021-06-30 23:36:46   Darryl Dillard                94   G2D 2QA
7  2021-07-05 22:24:50    Zeph Mcknight   65, Lodge House  BC01 7KJ
8  2021-07-14 17:25:12   Darryl Dillard               17B   B8V 1LS
9  2021-08-04 00:22:32    Zeph Mcknight               122   I37 1QZ
10 2021-08-22 19:33:49     Ivor Woodard                94   G2D 2QA
11 2021-08-23 21:22:00    Rhonda Slater                94   G2D 2QA
12 2021-09-09 18:41:56    Yoshio French               122   I37 1QZ
13 2021-09-15 21:59:33    Yoshio French                88   C10 4LH
14 2021-09-16 22:44:37         Sal Cobb                 5   OS7 6KB
15 2021-09-17 18:54:50     Hakeem Cross   65, Lodge House  BC01 7KJ
16 2021-10-11 22:39:26    Yoshio French                 5   OS7 6KB
17 2021-11-05 19:53:56  Porter Mcknight               122   I37 1QZ
18 2021-12-24 20:04:18     Hakeem Cross                 5   OS7 6KB
19 2021-12-29 23:29:09     Ivor Woodard                94   G2D 2QA

In [49]:
# TASK 3 - returns ALL products
# Context - The marketing team is planning a promotional campaign and wants to focus on the most popular products. You have been asked to generate a list of products, along with the total number of times each product was ordered. The list should be sorted from the most to the least popular product.
# Task - Write a query to display the product title and the total number of times it was ordered. Sort the results by the total number of times each product was ordered in descending order.
query = """
SELECT
    p.title,
    COALESCE(SUM(oc.amount), 0) as amount
FROM Product p
LEFT JOIN OrderContent oc
    ON oc.product_id = p.id
GROUP BY p.title
ORDER BY COALESCE(SUM(oc.amount), 0) DESC;
        """
run_sql_query(query, cursor)

                       title amount
0           Margherita pizza     14
1               Garlic bread     11
2  Coconut curry noodle bowl     11
3   Fried chicken (6 pieces)     10
4                Onion rings      8
5       Mozzarela sticks (4)      7
6                   BBQ ribs      6
7               Garden salad      6
8  Vegan chocolate milkshake      5
9                      Fries      0

In [48]:
# TASK 3 - only returns ordered products
# Context - The marketing team is planning a promotional campaign and wants to focus on the most popular products. You have been asked to generate a list of products, along with the total number of times each product was ordered. The list should be sorted from the most to the least popular product.
# Task - Write a query to display the product title and the total number of times it was ordered. Sort the results by the total number of times each product was ordered in descending order.
query = """
        SELECT
            p.title,
            SUM(oc.amount) AS amount
        FROM Product p
        JOIN OrderContent oc
            ON p.id = oc.product_id
        GROUP BY
            p.title
        ORDER BY
            SUM(oc.amount) DESC;
        """
run_sql_query(query, cursor)

                       title amount
0           Margherita pizza     14
1               Garlic bread     11
2  Coconut curry noodle bowl     11
3   Fried chicken (6 pieces)     10
4                Onion rings      8
5       Mozzarela sticks (4)      7
6                   BBQ ribs      6
7               Garden salad      6
8  Vegan chocolate milkshake      5

In [47]:
# TASK 4
# Context - The customer service team needs to identify customers who have more than one registered address in the system. This is important for flagging potential duplicates or handling complex delivery requirements.
# Task - Write a query to find all customers who have more than 1 registered address. Display the first name, last name, and number of addresses they have registered. Only list customers with more than one address.
query = """
SELECT
    c.first_name,
    c.last_name,
    COUNT(a.id) AS number_of_addresses
FROM Customer c
JOIN Address a
    ON a.customer_id = c.id
GROUP BY
    c.id,
    c.first_name,
    c.last_name
HAVING COUNT(a.id) > 1;
        """
run_sql_query(query, cursor)

  first_name last_name  number_of_addresses
0       Ivor   Woodard                    2

In [52]:
# TASK 5
# Context - The finance team is preparing a customer sales report to identify high-value customers for a loyalty program. You have been asked to provide the total revenue generated by each customer from all of their orders.
# Task - Write a query to calculate the total revenue for each customer and display the top 3. Display the customer’s full name (as customer_name) and their total revenue from all orders. The results should be sorted by total revenue in descending order, showing the most valuable customers first.
query = """
SELECT
    CONCAT(c.first_name, ' ', c.last_name) AS customer_name,
    SUM(oc.amount * p.price) AS total_revenue
FROM Customer c
     JOIN OnlineOrder o
          ON c.id = o.customer_id
     JOIN OrderContent oc
          ON o.id = oc.order_id
     JOIN Product p
          ON oc.product_id = p.id
GROUP BY c.id, c.first_name, c.last_name
ORDER BY total_revenue DESC
    LIMIT 3;
        """
run_sql_query(query, cursor)

   customer_name total_revenue
0   Hakeem Cross         85.80
1  Yoshio French         79.92
2       Sal Cobb         68.02